In [1]:
! pip show pandas

Name: pandas
Version: 2.0.1
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page:
Author:
Author-email: The Pandas Development Team <pandas-dev@python.org>
License: BSD 3-Clause License

Copyright (c) 2008-2011, AQR Capital Management, LLC, Lambda Foundry, Inc. and PyData Development Team
All rights reserved.

Copyright (c) 2011-2023, Open source contributors.

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

* Redistributions of source code must retain the above copyright notice, this
  list of conditions and the following disclaimer.

* Redistributions in binary form must reproduce the above copyright notice,
  this list of conditions and the following disclaimer in the documentation
  and/or other materials provided with the distribution.

* Neither the name of the copyright holder nor the names of its
  contributors may be used to endorse or promote products derived from
  this software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

Location: C:\Users\ASUS\AppData\Local\Programs\Python\Python311\Lib\site-packages
Requires: numpy, numpy, python-dateutil, pytz, tzdata
Required-by: seaborn, ultralytics

In [2]:
! pip show numpy

Name: numpy
Version: 1.24.3
Summary: Fundamental package for array computing in Python
Home-page: https://www.numpy.org
Author: Travis E. Oliphant et al.
Author-email:
License: BSD-3-Clause
Location: C:\Users\ASUS\AppData\Local\Programs\Python\Python311\Lib\site-packages
Requires:
Required-by: contourpy, h5py, imageio, matplotlib, ml-dtypes, moviepy, onnx, opencv-python, opt-einsum, pandas, scikit-image, scikit-learn, scipy, seaborn, tensorboard, tensorflow-intel, tifffile, torchvision

In [3]:
import numpy as np
import pandas as pd

In [4]:
# імпорт зміних і функцій в робочий простір
# незрозуміло звідки яка функція - важко читати код
# можуть виникати конфлікти з іншими бібліотеками
import pandas
from pandas import *
# pd.DataFrame() ->
DataFrame()

Empty DataFrame
Columns: []
Index: []

In [5]:
l = [1, 'dsf', 2.4] # прийнято
s = pd.Series([1, 'dsf', 2.4]) # не прийнято ->
s1 = pd.Series([1.0, 2.4]) #намагаємось мати один тип данних, але не обов'язково
print(l, s)

[1, 'dsf', 2.4] 0      1
1    dsf
2    2.4
dtype: object

### Імпорт даних

In [6]:
import os
print(os.listdir(),
      os.listdir('../'),
      os.listdir('../../data/'))

['notebook_1.ipynb'] ['.git', 'hometasks', 'lectures', 'README.md'] ['train.csv']

In [7]:
data_path = '../../data/train.csv'
df = pd.read_csv(data_path)

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df_shape = df.shape
df_shape
# перше значення - к-сть рядків, друге - колонок

(381109, 12)

In [10]:
print(df_shape[0], df_shape[1])
print(len(df))

381109 12
381109

In [11]:
df.memory_usage()
# скільки кожна колонка займає в бітах

Index                       132
id                      3048872
Gender                  3048872
Age                     3048872
Driving_License         3048872
Region_Code             3048872
Previously_Insured      3048872
Vehicle_Age             3048872
Vehicle_Damage          3048872
Annual_Premium          3048872
Policy_Sales_Channel    3048872
Vintage                 3048872
Response                3048872
dtype: int64

In [12]:
type(df.memory_usage())

pandas.core.series.Series

In [13]:
df.memory_usage().index
# найчастіше у результаті отримуємо DF aбо Series

Index(['Index', 'id', 'Gender', 'Age', 'Driving_License', 'Region_Code',
       'Previously_Insured', 'Vehicle_Age', 'Vehicle_Damage', 'Annual_Premium',
       'Policy_Sales_Channel', 'Vintage', 'Response'],
      dtype='object')

In [14]:
total_bytes = df.memory_usage().sum()
total_mbytes = total_bytes/(1024*1024)
total_mbytes.round()

35.0

In [15]:
# зчитати тільки частину даних
pd.read_csv(data_path, nrows=100)

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,1,Male,44,1,28.0,0,> 2 Years,Yes,40454.0,26.0,217,1
1,2,Male,76,1,3.0,0,1-2 Year,No,33536.0,26.0,183,0
2,3,Male,47,1,28.0,0,> 2 Years,Yes,38294.0,26.0,27,1
3,4,Male,21,1,11.0,1,< 1 Year,No,28619.0,152.0,203,0
4,5,Female,29,1,41.0,1,< 1 Year,No,27496.0,152.0,39,0
...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,Female,23,1,30.0,0,< 1 Year,No,26689.0,152.0,254,0
96,97,Male,50,1,28.0,0,1-2 Year,Yes,46995.0,52.0,291,0
97,98,Female,62,1,28.0,0,> 2 Years,Yes,41892.0,155.0,114,0
98,99,Female,21,1,2.0,0,< 1 Year,Yes,34274.0,152.0,79,0
99,100,Female,24,1,7.0,1,< 1 Year,Yes,2630.0,160.0,68,0

### Перегляд даних в Pandas

In [16]:
df.head()

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,1,Male,44,1,28.0,0,> 2 Years,Yes,40454.0,26.0,217,1
1,2,Male,76,1,3.0,0,1-2 Year,No,33536.0,26.0,183,0
2,3,Male,47,1,28.0,0,> 2 Years,Yes,38294.0,26.0,27,1
3,4,Male,21,1,11.0,1,< 1 Year,No,28619.0,152.0,203,0
4,5,Female,29,1,41.0,1,< 1 Year,No,27496.0,152.0,39,0

In [17]:
df.head(2)

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,1,Male,44,1,28.0,0,> 2 Years,Yes,40454.0,26.0,217,1
1,2,Male,76,1,3.0,0,1-2 Year,No,33536.0,26.0,183,0

In [18]:
df.tail()

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
381104,381105,Male,74,1,26.0,1,1-2 Year,No,30170.0,26.0,88,0
381105,381106,Male,30,1,37.0,1,< 1 Year,No,40016.0,152.0,131,0
381106,381107,Male,21,1,30.0,1,< 1 Year,No,35118.0,160.0,161,0
381107,381108,Female,68,1,14.0,0,> 2 Years,Yes,44617.0,124.0,74,0
381108,381109,Male,46,1,29.0,0,1-2 Year,No,41777.0,26.0,237,0

In [19]:
df.tail(1)

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
381108,381109,Male,46,1,29.0,0,1-2 Year,No,41777.0,26.0,237,0

In [20]:
df[200:220:2]

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
200,201,Male,55,1,28.0,0,1-2 Year,Yes,49470.0,124.0,203,0
202,203,Male,22,1,11.0,1,< 1 Year,No,21126.0,152.0,272,0
204,205,Female,30,1,28.0,0,< 1 Year,Yes,39104.0,122.0,263,1
206,207,Female,23,1,46.0,1,< 1 Year,No,18682.0,152.0,57,0
208,209,Male,24,1,6.0,1,< 1 Year,No,18576.0,151.0,245,0
210,211,Female,48,1,28.0,1,1-2 Year,No,35945.0,124.0,24,0
212,213,Male,44,1,28.0,0,> 2 Years,Yes,42754.0,124.0,23,1
214,215,Male,44,1,2.0,0,1-2 Year,No,34618.0,26.0,265,0
216,217,Female,60,1,28.0,0,> 2 Years,Yes,65472.0,26.0,36,0
218,219,Male,22,1,15.0,0,< 1 Year,Yes,32252.0,160.0,100,0

### Перегляд окремих рядків даних

In [21]:
df[100] # error, щчікується не індекс а назва колонки

KeyError: 100

In [ ]:
df[:1]

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,1,Male,44,1,28.0,0,> 2 Years,Yes,40454.0,26.0,217,1

In [ ]:
type(df['Gender'])

pandas.core.series.Series

In [ ]:
# ПРАВИЛЬНО ВИВЕСТИ ЗА ІНДЕКСОМ
df.loc[100]

id                           101
Gender                      Male
Age                           52
Driving_License                1
Region_Code                 28.0
Previously_Insured             1
Vehicle_Age             1-2 Year
Vehicle_Damage                No
Annual_Premium           36033.0
Policy_Sales_Channel        26.0
Vintage                       92
Response                       0
Name: 100, dtype: object

In [ ]:
print(type(df[100:101]),
      type(df.loc[100]), sep='\n')

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [ ]:
pd.DataFrame(df.loc[100])

                           100
id                         101
Gender                    Male
Age                         52
Driving_License              1
Region_Code               28.0
Previously_Insured           1
Vehicle_Age           1-2 Year
Vehicle_Damage              No
Annual_Premium         36033.0
Policy_Sales_Channel      26.0
Vintage                     92
Response                     0

In [ ]:
#Міняємо місцми рядки і колонки
pd.DataFrame(df.loc[100]).T

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
100,101,Male,52,1,28.0,1,1-2 Year,No,36033.0,26.0,92,0

In [ ]:
print(df[100:110:2].loc[102], '\n', 
df[100:110:2].iloc[1], sep='\n')

id                           103
Gender                    Female
Age                           20
Driving_License                1
Region_Code                 30.0
Previously_Insured             0
Vehicle_Age             < 1 Year
Vehicle_Damage               Yes
Annual_Premium           33227.0
Policy_Sales_Channel       160.0
Vintage                       78
Response                       0
Name: 102, dtype: object


id                           103
Gender                    Female
Age                           20
Driving_License                1
Region_Code                 30.0
Previously_Insured             0
Vehicle_Age             < 1 Year
Vehicle_Damage               Yes
Annual_Premium           33227.0
Policy_Sales_Channel       160.0
Vintage                       78
Response                       0
Name: 102, dtype: object

In [ ]:
df[100:110:2].iloc[102]

IndexError: single positional indexer is out-of-bounds

### Колонки і їх типи

In [ ]:
df.columns

Index(['id', 'Gender', 'Age', 'Driving_License', 'Region_Code',
       'Previously_Insured', 'Vehicle_Age', 'Vehicle_Damage', 'Annual_Premium',
       'Policy_Sales_Channel', 'Vintage', 'Response'],
      dtype='object')

In [ ]:
df.dtypes

id                        int64
Gender                   object
Age                       int64
Driving_License           int64
Region_Code             float64
Previously_Insured        int64
Vehicle_Age              object
Vehicle_Damage           object
Annual_Premium          float64
Policy_Sales_Channel    float64
Vintage                   int64
Response                  int64
dtype: object

In [ ]:
df.iloc[0].Gender

'Male'

In [ ]:
df.Gender

0           Male
1           Male
2           Male
3           Male
4         Female
           ...
381104      Male
381105      Male
381106      Male
381107    Female
381108      Male
Name: Gender, Length: 381109, dtype: object

### Опис даних в колонках

In [ ]:
df.describe()

,id,Age,Driving_License,Region_Code,Previously_Insured,Annual_Premium,Policy_Sales_Channel,Vintage,Response
count,381109.000000,381109.000000,381109.000000,381109.000000,381109.000000,381109.000000,381109.000000,381109.000000,381109.000000
mean,190555.000000,38.822584,0.997869,26.388807,0.458210,30564.389581,112.034295,154.347397,0.122563
std,110016.836208,15.511611,0.046110,13.229888,0.498251,17213.155057,54.203995,83.671304,0.327936
min,1.000000,20.000000,0.000000,0.000000,0.000000,2630.000000,1.000000,10.000000,0.000000
25%,95278.000000,25.000000,1.000000,15.000000,0.000000,24405.000000,29.000000,82.000000,0.000000
50%,190555.000000,36.000000,1.000000,28.000000,0.000000,31669.000000,133.000000,154.000000,0.000000
75%,285832.000000,49.000000,1.000000,35.000000,1.000000,39400.000000,152.000000,227.000000,0.000000
max,381109.000000,85.000000,1.000000,52.000000,1.000000,540165.000000,163.000000,299.000000,1.000000

In [ ]:
# Змінити кількість знаків післ коми

with pd.option_context('display.precision', 2):
    display(df.describe())

,id,Age,Driving_License,Region_Code,Previously_Insured,Annual_Premium,Policy_Sales_Channel,Vintage,Response
count,381109.00,381109.00,381109.00,381109.00,381109.00,381109.00,381109.00,381109.00,381109.00
mean,190555.00,38.82,1.00,26.39,0.46,30564.39,112.03,154.35,0.12
std,110016.84,15.51,0.05,13.23,0.50,17213.16,54.20,83.67,0.33
min,1.00,20.00,0.00,0.00,0.00,2630.00,1.00,10.00,0.00
25%,95278.00,25.00,1.00,15.00,0.00,24405.00,29.00,82.00,0.00
50%,190555.00,36.00,1.00,28.00,0.00,31669.00,133.00,154.00,0.00
75%,285832.00,49.00,1.00,35.00,1.00,39400.00,152.00,227.00,0.00
max,381109.00,85.00,1.00,52.00,1.00,540165.00,163.00,299.00,1.00

In [ ]:
with pd.option_context('display.precision', 2):
    display(df.describe(percentiles=[0.01, 0.1, 0.2, 0.5, 0.7, 0.9, 0.99]))

,id,Age,Driving_License,Region_Code,Previously_Insured,Annual_Premium,Policy_Sales_Channel,Vintage,Response
count,381109.00,381109.00,381109.00,381109.00,381109.00,381109.00,381109.00,381109.00,381109.00
mean,190555.00,38.82,1.00,26.39,0.46,30564.39,112.03,154.35,0.12
std,110016.84,15.51,0.05,13.23,0.50,17213.16,54.20,83.67,0.33
min,1.00,20.00,0.00,0.00,0.00,2630.00,1.00,10.00,0.00
1%,3812.08,20.00,1.00,2.00,0.00,2630.00,8.00,12.00,0.00
10%,38111.80,22.00,1.00,8.00,0.00,2630.00,26.00,38.00,0.00
20%,76222.60,24.00,1.00,11.00,0.00,21583.60,26.00,68.00,0.00
50%,190555.00,36.00,1.00,28.00,0.00,31669.00,133.00,154.00,0.00
70%,266776.60,47.00,1.00,31.00,1.00,37548.00,152.00,212.00,0.00
90%,342998.20,62.00,1.00,46.00,1.00,48431.00,156.00,270.00,1.00
99%,377297.92,77.00,1.00,50.00,1.00,72963.00,160.00,297.00,1.00
max,381109.00,85.00,1.00,52.00,1.00,540165.00,163.00,299.00,1.00

### Вибір колонок

In [ ]:
df.columns

Index(['id', 'Gender', 'Age', 'Driving_License', 'Region_Code',
       'Previously_Insured', 'Vehicle_Age', 'Vehicle_Damage', 'Annual_Premium',
       'Policy_Sales_Channel', 'Vintage', 'Response'],
      dtype='object')

In [ ]:
# як у словнику
df['id'], df['Age']

(0              1
 1              2
 2              3
 3              4
 4              5
            ...
 381104    381105
 381105    381106
 381106    381107
 381107    381108
 381108    381109
 Name: id, Length: 381109, dtype: int64,
 0         44
 1         76
 2         47
 3         21
 4         29
           ..
 381104    74
 381105    30
 381106    21
 381107    68
 381108    46
 Name: Age, Length: 381109, dtype: int64)

In [ ]:
# як атрибут df через крапку
df.id, df.Gender, df.Driving_License

(0              1
 1              2
 2              3
 3              4
 4              5
            ...
 381104    381105
 381105    381106
 381106    381107
 381107    381108
 381108    381109
 Name: id, Length: 381109, dtype: int64,
 0           Male
 1           Male
 2           Male
 3           Male
 4         Female
            ...
 381104      Male
 381105      Male
 381106      Male
 381107    Female
 381108      Male
 Name: Gender, Length: 381109, dtype: object,
 0         1
 1         1
 2         1
 3         1
 4         1
          ..
 381104    1
 381105    1
 381106    1
 381107    1
 381108    1
 Name: Driving_License, Length: 381109, dtype: int64)

In [ ]:
df['Нова колонка'] = 1

In [ ]:
df['Нова колонка']

0         1
1         1
2         1
3         1
4         1
         ..
381104    1
381105    1
381106    1
381107    1
381108    1
Name: Нова колонка, Length: 381109, dtype: int64

In [ ]:
# Тільки латиниця з розділювачем _
df.Нова колонка

SyntaxError: invalid syntax (2540395505.py, line 1)

In [ ]:
df.NewCol = 1

In [ ]:
df.head()

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response,Нова колонка
0,1,Male,44,1,28.0,0,> 2 Years,Yes,40454.0,26.0,217,1,1
1,2,Male,76,1,3.0,0,1-2 Year,No,33536.0,26.0,183,0,1
2,3,Male,47,1,28.0,0,> 2 Years,Yes,38294.0,26.0,27,1,1
3,4,Male,21,1,11.0,1,< 1 Year,No,28619.0,152.0,203,0,1
4,5,Female,29,1,41.0,1,< 1 Year,No,27496.0,152.0,39,0,1

In [ ]:
# декілька колонок за раз
df[['Gender', 'Driving_License']]

        Gender  Driving_License
0         Male                1
1         Male                1
2         Male                1
3         Male                1
4       Female                1
...        ...              ...
381104    Male                1
381105    Male                1
381106    Male                1
381107  Female                1
381108    Male                1

[381109 rows x 2 columns]

In [ ]:
# У результаті отримуємо DF або Series і можум озастосувати до них далі ті самі операції
df_selected = df[['Age', 'Gender']]
df_selected.head()

   Age  Gender
0   44    Male
1   76    Male
2   47    Male
3   21    Male
4   29  Female

In [ ]:
df_selected[1000:1100]['Gender'][0:10]

1000      Male
1001    Female
1002    Female
1003    Female
1004      Male
1005    Female
1006      Male
1007      Male
1008    Female
1009    Female
Name: Gender, dtype: object

In [ ]:
df_selected[1000:1100].Gender[0:10]

1000      Male
1001    Female
1002    Female
1003    Female
1004      Male
1005    Female
1006      Male
1007      Male
1008    Female
1009    Female
Name: Gender, dtype: object

In [ ]:
df_selected.Gender[1000:1100].loc[1019]

'Female'

In [ ]:
df_selected.Age[1000:1100].iloc[3].astype('str')

'25'

### Переглд значень КАТЕГОРІАЛЬНИХ колонок

In [ ]:
df.select_dtypes('object')
# df.dtypes

        Gender Vehicle_Age Vehicle_Damage
0         Male   > 2 Years            Yes
1         Male    1-2 Year             No
2         Male   > 2 Years            Yes
3         Male    < 1 Year             No
4       Female    < 1 Year             No
...        ...         ...            ...
381104    Male    1-2 Year             No
381105    Male    < 1 Year             No
381106    Male    < 1 Year             No
381107  Female   > 2 Years            Yes
381108    Male    1-2 Year             No

[381109 rows x 3 columns]

In [ ]:
df.select_dtypes('number')

,id,Age,Driving_License,Region_Code,Previously_Insured,Annual_Premium,Policy_Sales_Channel,Vintage,Response,Нова колонка
0,1,44,1,28.0,0,40454.0,26.0,217,1,1
1,2,76,1,3.0,0,33536.0,26.0,183,0,1
2,3,47,1,28.0,0,38294.0,26.0,27,1,1
3,4,21,1,11.0,1,28619.0,152.0,203,0,1
4,5,29,1,41.0,1,27496.0,152.0,39,0,1
...,...,...,...,...,...,...,...,...,...,...
381104,381105,74,1,26.0,1,30170.0,26.0,88,0,1
381105,381106,30,1,37.0,1,40016.0,152.0,131,0,1
381106,381107,21,1,30.0,1,35118.0,160.0,161,0,1
381107,381108,68,1,14.0,0,44617.0,124.0,74,0,1
381108,381109,46,1,29.0,0,41777.0,26.0,237,0,1

In [ ]:
df.select_dtypes('object').columns

Index(['Gender', 'Vehicle_Age', 'Vehicle_Damage'], dtype='object')

In [ ]:
# унікальні значення
df.Gender.unique()

array(['Male', 'Female'], dtype=object)

In [ ]:
# кількість унікальних значень
df.Vehicle_Age.nunique()

3

In [ ]:
# кількість рядків з дл кожного унікального значення
df.Vehicle_Age.value_counts()

Vehicle_Age
1-2 Year     200316
< 1 Year     164786
> 2 Years     16007
Name: count, dtype: int64

In [ ]:
df.Vehicle_Age.value_counts()[['< 1 Year', '1-2 Year']].sum()

365102

In [ ]:
# Приклад який відсоток становить кожне значення
gCounts = df.Gender.value_counts()
print(type(gCounts))

total = gCounts.sum()
# total = df.Gender.count()

print('Result:') 
gCounts/total

<class 'pandas.core.series.Series'>
Result:

Gender
Male      0.540761
Female    0.459239
Name: count, dtype: float64

In [ ]:
# Те саме можна отримати нормалізувавши значення при їх підрахунку
df.Gender.value_counts(normalize=True)

Gender
Male      0.540761
Female    0.459239
Name: proportion, dtype: float64

In [ ]:
# Арифметичні операції над Series та List
example = pd.Series(range(100))
exampleList = list(range(100))
example.head(), exampleList[:5]

(0    0
 1    1
 2    2
 3    3
 4    4
 dtype: int64,
 [0, 1, 2, 3, 4])

In [ ]:
example = example + 3
example.head()

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [ ]:
# Не працює для списків
exampleList + 3

TypeError: can only concatenate list (not "int") to list

In [ ]:
example = example * 3
exampleList = exampleList * 3
example.head() , len(exampleList)

(0     9
 1    12
 2    15
 3    18
 4    21
 dtype: int64,
 300)

### Фільтрація даних

In [26]:
df.columns

Index(['id', 'Gender', 'Age', 'Driving_License', 'Region_Code',
       'Previously_Insured', 'Vehicle_Age', 'Vehicle_Damage', 'Annual_Premium',
       'Policy_Sales_Channel', 'Vintage', 'Response'],
      dtype='object')

In [24]:
df[df.Gender == 'Male'].Age.describe()

count    206089.000000
mean         40.903095
std          15.449718
min          20.000000
25%          26.000000
50%          41.000000
75%          52.000000
max          85.000000
Name: Age, dtype: float64

In [25]:
df[df.Gender == 'Female'].Age.describe()

count    175020.000000
mean         36.372746
std          15.223969
min          20.000000
25%          24.000000
50%          30.000000
75%          46.000000
max          85.000000
Name: Age, dtype: float64

In [30]:
f1 = (df.Gender == 'Male') & (df.Age >= 26) & (df['Age'] <= 52)
df[f1].Response.value_counts(normalize=True)

Response
0    0.815225
1    0.184775
Name: proportion, dtype: float64

In [33]:
f1 = (df.Gender == 'Male') & ((df.Age < 26) | (df['Age'] > 52))
df[f1].Response.value_counts(normalize=True)

Response
0    0.911723
1    0.088277
Name: proportion, dtype: float64

In [38]:
# метод query()
df.query('Gender == "Male" & Age < 30').Response.value_counts(normalize=True)

Response
0    0.949671
1    0.050329
Name: proportion, dtype: float64

In [44]:
df.query('Gender == "Female" & Age > 55').Response.value_counts(normalize=True)

Response
0    0.895496
1    0.104504
Name: proportion, dtype: float64

### Тест для дз

In [ ]:
d = {'A': [12, 22, 32, 42, 52],
    'B' : ['sdfsd', '23f', '4sdf', 'werwer', 'dsf'],
    'C': [[1, 3], [1, 3], [5, 6, 3],[1, 3],[1, 3]]}
test = pd.DataFrame(d)
test

    A       B          C
0  12   sdfsd     [1, 3]
1  22     23f     [1, 3]
2  32    4sdf  [5, 6, 3]
3  42  werwer     [1, 3]
4  52     dsf     [1, 3]

In [ ]:

test[['B', 'C']][0:5:2]

       B          C
0  sdfsd     [1, 3]
2   4sdf  [5, 6, 3]
4    dsf     [1, 3]

In [ ]:
test.loc[0: 4:2][['B', 'C']]

       B          C
0  sdfsd     [1, 3]
2   4sdf  [5, 6, 3]
4    dsf     [1, 3]

In [ ]:
test.iloc[0:5:2]

    A      B          C
0  12  sdfsd     [1, 3]
2  32   4sdf  [5, 6, 3]
4  52    dsf     [1, 3]

In [ ]:
test.loc[[0, 2, 4], ['B', 'C']]

       B          C
0  sdfsd     [1, 3]
2   4sdf  [5, 6, 3]
4    dsf     [1, 3]

In [ ]:
test.iloc[[0, 2, 4], [1, 2]]

       B          C
0  sdfsd     [1, 3]
2   4sdf  [5, 6, 3]
4    dsf     [1, 3]

In [ ]:
test.iloc[0:5, 1:3]

        B          C
0   sdfsd     [1, 3]
1     23f     [1, 3]
2    4sdf  [5, 6, 3]
3  werwer     [1, 3]
4     dsf     [1, 3]